////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
/////////乱数を発生させるヘッダーファイルです///////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
/////////このファイル(random.h)をインクルードしてください///////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
//使い方　変数idumはlong型のポインタなのでlong型の変数を宣言し，アドレスを代入してください．////
//        乱数関数の初期化の時引数には負の値を代入してください.                               //
//        またそれ以降は乱数関数を呼び出す時はidumを変えないでください.                       //
//例                                                                                          //
// long idum = -1;                                                                          //
// uniform1(&idum);                                                                          //
//さらにidumの後に引数を入力することで各乱数関数のデフォルトの値を変えられます.               //
//例　uniform2(&number,10);←aの値が10                                                        //
////////////////////////////////////////////////////////////////////////////////////////////////

#ifndef __RANDOM_H__
#define __RANDOM_H__

#include"nrutil.cpp"
#include"ran1.cpp"
#include"ran4.cpp"
#include"psdes.cpp"
#include"expdev.cpp"
#include"gasdev.cpp"

//一様乱数 0.0から1.0までの値を返す．
inline float uniform1(long *idum)
{
	return ran4(idum);
}
//一様乱数
//デフォルトはa=1.0
//-a/2からa/2まで乱数が分布
inline float uniform2(long *idum, float a = 1.0)
{
	return 0.5*a*ran4(idum) - 0.5*a*ran4(idum);
}

//正規分布に従う乱数
//デフォルトは標準偏差１.0,平均0.0,分散1.0
inline float normal(long *idum, float stdev = 1.0)
{
	return stdev*gasdev(idum);
}

//指数分布の乱数
//デフォルトは平均1.0
inline float exponent(long *idum, float ave = 1.0)
{
	return expdev(idum)*ave;
}

#endif __RANDOM_H__